{
    "docstore": [
        {
            "doc_id": "chunk_0",
            "page_content": "Foto oleh : Ferrian Reynaldi Balkondes Karangrejo - Magelang\nGereja Blenduk, Kota Lama - Semarang\nDaftar Isi\nJourney to Wander Semarang Destinasi Wisata Semarang Lawang",
            "metadata": {
                "chunk_id": "chunk_0",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_1",
            "page_content": "Sewu Kota Lama Semarang Semarang Contemporary Art Speigel Cafe Kuil Sam Poo Kong Surakarta Destinasi Wisata Surakarta Keraton Surakarta Kampung Batik Kauman Triwindu Antique Shop Selat Solo Mbak Lies Tumurun Private Museum De Tjolomadoe Magelang Destinatsi Wisata Magelang Svargabumi Borobudur Balkondes Karang Rejo Penutup Kolaborator 4 5 6 7 9 10 11 12 13 14 15 17 18 19 20 21 23 24 25 28 30 31 Foto oleh : Ferrian Reynaldi JOURNEY TO WANDER JOURNEY TO WANDER #ThoughtfulIndonesia menjadi landasan",
            "metadata": {
                "chunk_id": "chunk_1",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_2",
            "page_content": "Kementerian Pariwisata & Ekonomi Kreatif (KEMENPAREKAF) dalam menghadirkan gagasan dan program yang dinamakan Journey To Wander .",
            "metadata": {
                "chunk_id": "chunk_2",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_3",
            "page_content": "“Travel Beyond The Creativity”, sebagai ide  menjalankan pariwisata yang penuh makna dan bekerja sama dengan industri  kreatif dalam menghadapi Covid-19. Industri Kreatif menjadi media yang tepat  untuk menghidupkan kembali kunjungan wisata ke destinasi yang ikonik dan  penuh makna di Indonesia dengan mengenalkan gerakan BISA (Bersih, Indah,  Sehat, dan Aman) melalui karya dan cerita untuk disampaikan.",
            "metadata": {
                "chunk_id": "chunk_3",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_4",
            "page_content": "Industri Kreatif menjadi media yang tepat  untuk menghidupkan kembali kunjungan wisata ke destinasi yang ikonik dan  penuh makna di Indonesia dengan mengenalkan gerakan BISA (Bersih, Indah,  Sehat, dan Aman) melalui karya dan cerita untuk disampaikan. Kami berkolaborasi bersama para pegiat kreatif tanah air untuk berkarya dari  inspirasi selama perjalanan berkunjung ke setiap destinasi pariwisata yang  memberlakukan protokol kesehatan BISA. Sehingga,  Journey To Wander   menjadi gerakan yang meleburkan esensi perjalanan menjadi sebuah proses  kreativitas yang produktif.",
            "metadata": {
                "chunk_id": "chunk_4",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_5",
            "page_content": "Sehingga,  Journey To Wander   menjadi gerakan yang meleburkan esensi perjalanan menjadi sebuah proses  kreativitas yang produktif. Sebuah perjalanan kontemplatif mengunjungi 3  destinasi di Semarang, Solo, dan Magelang melahirkan inspirasi yang  didapatkan oleh setiap praktisi pegiat kreatif untuk diekspresikan dalam  bentuk karya visual maupun tulisan yang setiap ceritanya dapat dinikmati  setiap ceritanya dalam mini book ini. Selamat menelusuri perjalanan yang  penuh kolaborasi!",
            "metadata": {
                "chunk_id": "chunk_5",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_6",
            "page_content": "Selamat menelusuri perjalanan yang  penuh kolaborasi! Foto oleh : Ferrian Reynaldi\n4\nJOURNEY TO WANDER\nPeta Destinasi Wisata SEMARANG\nJourney To Wander  ini dibuka dengan perjalanan ke  Semarang, khususnya berkunjung ke destinasi wisata yang  sudah memberlakukan protokol kesehatan BISA untuk  melakukan traveling. Di Semarang akan banyak dijumpai  deretan arsitektur kota tua yang masih terjaga dan juga  beberapa destinasi yang masih mempertahankan bangunan  sejarah dan budayanya.",
            "metadata": {
                "chunk_id": "chunk_6",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_7",
            "page_content": "Di Semarang akan banyak dijumpai  deretan arsitektur kota tua yang masih terjaga dan juga  beberapa destinasi yang masih mempertahankan bangunan  sejarah dan budayanya. Suasana kota yang dekat dengan seni membawa banyak  inspirasi untuk menciptakan karya-karya baru. Berikut  adalah destinasi wisata yang dikunjungi selama perjalanan  ke  Semarang;  Lawang  Sewu,  Spiegel,  Semarang  Contemporary Art Gallery, dan Galeri Industri Kreatif.",
            "metadata": {
                "chunk_id": "chunk_7",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_8",
            "page_content": "Berikut  adalah destinasi wisata yang dikunjungi selama perjalanan  ke  Semarang;  Lawang  Sewu,  Spiegel,  Semarang  Contemporary Art Gallery, dan Galeri Industri Kreatif. 1\n2\n3\n4\n5\nKuil Sam Poo Kong\nLawang Sewu\nKota Lama Semarang\nSemarang Contemporary Art\nSpiegel \n6\nU\n1\n2\n3\n4\n5\nJOURNEY TO WANDER\nLAWANG SEWU\nUlasan oleh : Mada Riyanhadi Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Semarang Tengah, Kota Semarang, Jawa Tengah\nLawang  Sewu  menjadi  destinasi  pertama  kami  ketika  menginjakkan kaki di Kota Semarang.",
            "metadata": {
                "chunk_id": "chunk_8",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_9",
            "page_content": "Semarang Tengah, Kota Semarang, Jawa Tengah\nLawang  Sewu  menjadi  destinasi  pertama  kami  ketika  menginjakkan kaki di Kota Semarang. Tempat ini merupakan  bangunan bersejarah milik PT Kereta Api Indonesia (Persero) yang  awalnya digunakan sebagai Kantor Pusat Perusahaan Kereta Api  Swasta  Nederlandsch-Indische Spoorweg Maatschappij  (NISM) sekitar tahun 1918-an. (heritage.kai.id)\nKetika akan memasuki area ini, kami semua harus mengikuti  protokol kesehatan seperti; menggunakan masker, mencuci  tangan, dan pengecekan suhu badan. Untuk masuk ke dalam area  cukup scan barcode dari lembaran tiket.",
            "metadata": {
                "chunk_id": "chunk_9",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_10",
            "page_content": "Untuk masuk ke dalam area  cukup scan barcode dari lembaran tiket. Di Lawang Sewu ini kita  bisa belajar mengenai sejarah tentang kereta api di Indonesia  yang dimuat dalam bentuk foto dan miniatur kereta api. Buat teman-teman yang menyukai foto arsitek, tempat ini sangat  direkomendasikan untuk dikunjungi. Banyak sekali spot-spot yang  menarik dan unik yang bisa diabadikan. 8\nSEMARANG\nKOTA LAMA SEMARANG\nJl.",
            "metadata": {
                "chunk_id": "chunk_10",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_11",
            "page_content": "8\nSEMARANG\nKOTA LAMA SEMARANG\nJl. Mas, Kec. Semarang Utara, Kota Semarang, Jawa Tengah\nUlasan oleh  : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh   : Wastana Haikal\nMencari oleh-oleh unik untuk sanak saudara ataupun teman? Tentunya Galeri Industri Kreatif yang berada di Kota Lama Semarang  adalah destinasi yang wajib kamu kunjungi. Di tempat ini, kamu bisa  menemukan berbagai produk kreatif mulai dari tas, batik, baju,  sepatu, hingga kopi khas Semarang untuk kamu bawa pulang.",
            "metadata": {
                "chunk_id": "chunk_11",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_12",
            "page_content": "Di tempat ini, kamu bisa  menemukan berbagai produk kreatif mulai dari tas, batik, baju,  sepatu, hingga kopi khas Semarang untuk kamu bawa pulang. Kisaran harga dari ragam barang yang dijual di sini pun mulai dari  harga yang relatif murah. Tempatnya sangat nyaman untuk kamu  memilih-milih oleh-oleh tanpa harus berdesak-desakan atau  berpanas-panasan. Produk-produk yang dijual di sini juga bisa dibeli  secara online melalui akun Instagram mereka di @SemarangCreativeGallery\n9\nJOURNEY TO WANDER\nAktivitas yang paling tepat ketika berada di area Kota Lama Semarang adalah berjalan kaki. Tak jauh dari tempat kami berteduh (Spiegel Bar  & Resto)",
            "metadata": {
                "chunk_id": "chunk_12",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_13",
            "page_content": "Tak jauh dari tempat kami berteduh (Spiegel Bar  & Resto) terdapat salah satu museum yang berdiri sejak tahun 2001  yaitu Semarang Contemporary Art Gallery. Bangunan ini dulunya  merupakan Gedung perusahaan asuransi pertama di Indonesia De  Indische Lloyd pada tahun 1937-an. Museum galeri ini berlantai 2 dan  dipengaruhi oleh arsitektur khas kolonial. Untuk masuk ke museum ini cukup membayar tiket 10 ribu saja. Saat  akan masuk ke dalam museum kita diwajibkan untuk selalu  mengenakan masker dan di cek suhu badan terlebih dahulu.",
            "metadata": {
                "chunk_id": "chunk_13",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_14",
            "page_content": "Saat  akan masuk ke dalam museum kita diwajibkan untuk selalu  mengenakan masker dan di cek suhu badan terlebih dahulu. Terdapat  berbagai macam koleksi seni dari seniman lokal. Menariknya, galeri  seni ini selalu rutin untuk di perbaharui. Jadi, belum tentu sama  koleksi seninya ketika berkunjung lagi. SEMARANG CONTEMPORARY ART\nUlasan oleh : Mada Riyanhadi Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Mas, Kec. Semarang Utara, Kota Semarang, Jawa Tengah\n10\nSEMARANG\nKetika berkunjung ke Semarang, kami harus siap berkawan  dengan teriknya matahari.",
            "metadata": {
                "chunk_id": "chunk_14",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_15",
            "page_content": "Mas, Kec. Semarang Utara, Kota Semarang, Jawa Tengah\n10\nSEMARANG\nKetika berkunjung ke Semarang, kami harus siap berkawan  dengan teriknya matahari. Matahari di Semarang serasa ada 9  ya! – Ujar teman kami sembari tertawa. Kami berteduh sejenak  di salah satu kedai kopi di tengah Kota Lama Semarang yaitu  Spiegel Bar & Bistro. Dulunya tempat ini merupakan bangunan yang berfungsi sebagai toko yang menyediakan berbagai  macam barang untuk keperluan rumah tangga atau kantor  yang dimiliki oleh Tuan H. Spiegel pada tahun 1908-an.  (seputarsemarang.com) Kami sangat menyukai suasana di kedai kopi ini, kesan vintage  terlihat di seluruh area.",
            "metadata": {
                "chunk_id": "chunk_15",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_16",
            "page_content": "Kami sangat menyukai suasana di kedai kopi ini, kesan vintage  terlihat di seluruh area. Berbincang dan duduk di pinggir  jendela sambil menikmati jalanan Kota Semarang menjadi \nSPIEGEL BAR & BISTRO\nUlasan oleh : Mada Riyanhadi Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Mas, Kec. Semarang Utara, Kota Semarang, Jawa Tengah\nsesuatu yang menarik bagi kami. Spiegel Bar & Resto juga  menerapkan protokol kesehatan di mana setiap pengunjung  yang akan masuk diharuskan untuk menggunakan hand  sanitizer serta tempat duduk antar pengunjung pun diberi  jarak.",
            "metadata": {
                "chunk_id": "chunk_16",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_17",
            "page_content": "Spiegel Bar & Resto juga  menerapkan protokol kesehatan di mana setiap pengunjung  yang akan masuk diharuskan untuk menggunakan hand  sanitizer serta tempat duduk antar pengunjung pun diberi  jarak. Untuk makanan dan minuman, Spiegel Bar & Resto  menyediakan menumakanan Italian, American, European &  Contemporary. 11\nJOURNEY TO WANDER\nKUIL SAM POO KONG\nSaat berkunjung ke kota Semarang, pastikan kamu mampir juga ke  destinasi wisata yang eksotik ini. Dengan berbekal tiket 40 ribu,  kamu bisa mendapatkan pemandangan kuil Pecinan tertua di  Semarang.",
            "metadata": {
                "chunk_id": "chunk_17",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_18",
            "page_content": "Dengan berbekal tiket 40 ribu,  kamu bisa mendapatkan pemandangan kuil Pecinan tertua di  Semarang. Bangunan historikal ini juga sangat indah untuk kamu  kunjungi untuk wisata sejarah atau untuk sekedar berfoto-foto di  bangunan kuilnya yang berwarna merah, indah dan megah. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Simongan No.129, Bongsari, Kec. Semarang Barat, Kota Semarang, Jawa Tengah\n12\nSEMARANG JOURNEY TO WANDER\nPeta Destinasi Wisata SURAKARTA\nSebuah perjalanan penuh makna ketika mengunjungi  Solo, sebuah kota yang tertata rapi.",
            "metadata": {
                "chunk_id": "chunk_18",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_19",
            "page_content": "Simongan No.129, Bongsari, Kec. Semarang Barat, Kota Semarang, Jawa Tengah\n12\nSEMARANG JOURNEY TO WANDER\nPeta Destinasi Wisata SURAKARTA\nSebuah perjalanan penuh makna ketika mengunjungi  Solo, sebuah kota yang tertata rapi. Kota Solo masih kuat  mempertahankan budaya dan sejarahnya, terlihat dari  setiap bangunan tua yang terjaga, hasil kreativitas yang  masih diciptakan, hingga kuliner yang ada. Perjalanan destinasi kedua ini penuh pelajaran budaya  dan sejarah. Berikut keenam destinasi wisata yang  memberlakukan protokol BISA agar perjalanan tetap  aman dan nyaman; Tumurun Private Museum, Pasar  Triwindu, Keraton Surakarta, The Tjolomadoe, Kampung  Batik Kauman, dan Selat Solo.",
            "metadata": {
                "chunk_id": "chunk_19",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_20",
            "page_content": "Berikut keenam destinasi wisata yang  memberlakukan protokol BISA agar perjalanan tetap  aman dan nyaman; Tumurun Private Museum, Pasar  Triwindu, Keraton Surakarta, The Tjolomadoe, Kampung  Batik Kauman, dan Selat Solo. 1\n2\n3\n4\n5\n6\nDe Tjolomadoe\nTurumun Private Museum\nTriwindu Antique Shop\nKampung Batik Kauman\nKeraton Surakarta\nSelat Solo Mbak Lies\n14\n1\n2\n3\n4\n5\n6\nU\nJOURNEY TO WANDER\nSolo tentu sangat erat hubungannya dengan Keraton Surakarta,  jika kamu mampir ke Solo, kamu bisa langsung melihat  bangunan keraton yang indah dan megah. Arsitektur Keraton  Surakarta ini dihiasi dengan warna putih dan biru dengan gaya  arsitektur campuran Jawa - Eropa.",
            "metadata": {
                "chunk_id": "chunk_20",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_21",
            "page_content": "Arsitektur Keraton  Surakarta ini dihiasi dengan warna putih dan biru dengan gaya  arsitektur campuran Jawa - Eropa. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Kliwon, Kota Surakarta, Jawa Tengah\nSURAKARTA\n16 KAMPUNG BATIK KAUMAN\nUlasan oleh : Debby Permata Foto oleh  : Mada Riyanhadi Illustrasi oleh  : Wastana Haikal\nKauman, Kec. Kliwon, Kota Surakarta, Jawa Tengah 57122\nPergi ke Solo kurang lengkap rasanya jika tidak mampir ke  Kampung Batik Kauman untuk membeli batik.",
            "metadata": {
                "chunk_id": "chunk_21",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_22",
            "page_content": "Kliwon, Kota Surakarta, Jawa Tengah 57122\nPergi ke Solo kurang lengkap rasanya jika tidak mampir ke  Kampung Batik Kauman untuk membeli batik. Di sini, kamu bisa  membeli batik printing, cap, tulis dengan ragam warna dan juga  model yang sangatlah lengkap dan juga indah. Jika Anda mencari  batik khas Solo, jangan lupa mampir ke Kampung Batik Kauman. 17\nJOURNEY TO WANDER\nTRIWINDU ANTIQUE Kliwon, Kota Surakarta, Jawa Tengah 57122\nBuat pecinta barang-barang antik, sangat direkomendasikan untuk berkunjung ke Pasar Triwindu Solo.",
            "metadata": {
                "chunk_id": "chunk_22",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_23",
            "page_content": "Kliwon, Kota Surakarta, Jawa Tengah 57122\nBuat pecinta barang-barang antik, sangat direkomendasikan untuk berkunjung ke Pasar Triwindu Solo. Karena di tempat ini kami  disuguhkan oleh pemandangan berbagai macam barang-barang  antik seperti; kursi, lampu gantung, lukisan, patung, dan masih  banyak lagi. Pasar Triwindu juga menjadi pusat oleh-oleh buat  pecinta atau koleksi barang-barang antik. Memang harus bersabar dan jeli untuk mendapatkan barang yang  unik disini. Harga yang ditawarkannya pun juga sangat terjangkau,  kita bisa bernegoisasi langsung dengan penjualnya.",
            "metadata": {
                "chunk_id": "chunk_23",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_24",
            "page_content": "Harga yang ditawarkannya pun juga sangat terjangkau,  kita bisa bernegoisasi langsung dengan penjualnya. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\n18\nSURAKARTA\nSELAT SOLO MBAK LIES\nBelum ke Solo rasanya jika kamu tidak mencoba makanan yang  satu ini. Selat solo Mbak Lies adalah tempat yang paling tepat  untuk kamu mencoba selat solo dengan rasa yang nikmat dan  paling autentik.",
            "metadata": {
                "chunk_id": "chunk_24",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_25",
            "page_content": "Selat solo Mbak Lies adalah tempat yang paling tepat  untuk kamu mencoba selat solo dengan rasa yang nikmat dan  paling autentik. Bila mampir ke sana, selain lidah kita  dimanjakan dengan rasa selat solonya yang nikmat, mata kita  juga dimanjakan dengan desain interior restorannya yang sangat  berwarna-warni dan juga unik. Salah satu menu paling favorit di  selat solo Mbak Lies ini adalah selat solo lidah, dijamin lidah Anda dimanjakan dengan rasanya yang unik dan nikmat. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Renaldi Illustrasi oleh  : Wastana Haikal\nJl.",
            "metadata": {
                "chunk_id": "chunk_25",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_26",
            "page_content": "Ulasan oleh : Debby Permata Foto oleh  : Ferrian Renaldi Illustrasi oleh  : Wastana Haikal\nJl. Serengan, Kota Surakarta, Jawa Tengah\n19\nJOURNEY TO WANDER\nUlasan oleh : Mada Riyanhadi Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nSebuah pengalaman yang luar biasa bagi kami bisa  berkunjung ke Private Museum yang berlokasi di Solo. Museum ini merupakan private museum milik keluarga  Lukminto pendiri PT. Sri Rejeki Isman (Sritex) yang dibangun  oleh anak Almarhum HM. Tujuan didirikan  museum ini yakni untuk memajang koleksi karya seni milik  ayahnya (Alm.",
            "metadata": {
                "chunk_id": "chunk_26",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_27",
            "page_content": "Tujuan didirikan  museum ini yakni untuk memajang koleksi karya seni milik  ayahnya (Alm. Kami sedikit penasaran dengan nama Tumurun. Apa sih  Tumurun? – ujar kami kepada salah satu guide di Tumurun  Private Museum. Beliau menjelaskan nama “Tumurun”  merupakan “Turun Temurun” atau museum yang dibangun  dan diteruskan oleh anak-anaknya. Ketika kami berkunjung\nTUMURUN PRIVATE MUSEUM\nke Museum ini, memori kami tertuju oleh Artjog. Benar saja,  beberapa koleksi seni milik Alm. Lukminto ini  merupakan pembelian dari seniman yang tampil di Artjog.",
            "metadata": {
                "chunk_id": "chunk_27",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_28",
            "page_content": "Lukminto ini  merupakan pembelian dari seniman yang tampil di Artjog. Salah satunya seperti karya “Bola Mata” milik seniman  Yogyakarta (Wedhar Riyadi). Untuk masuk ke museum ini gratis, akan tetapi diharuskan  reservasi terlebih dahulu. Menentukan jadwal kunjungan  serta berapa orang yang akan berkunjung. Kebangkitan Nasional No.2/4, Sriwedari, Kec. Laweyan, Kota Surakarta, Jawa Tengah\n20\nSURAKARTA DE TJOLOMADOE\nUlasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\nJl. Adi Sucipto No.1, Paulan Wetan, Malangjiwan, Kec.",
            "metadata": {
                "chunk_id": "chunk_28",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_29",
            "page_content": "Adi Sucipto No.1, Paulan Wetan, Malangjiwan, Kec. Colomadu, Kabupaten Karanganyar, Jawa Tengah\nDibangun pada tahun 1861, tentunya Tjolomadoe adalah  salah satu bangunan bersejarah di Solo yang wajib kamu  kunjungi. Bangunan ini dibangun sebagai pabrik gula yang  kemudian dijadikan museum dengan arsitektur yang indah  dan megah. Selain area museum, di sini terdapat juga  Tjolomadoe Concert Hall dan juga Sarkara sebagai  multifunctional hall, selain itu terdapat juga toko-toko kecil  untuk",
            "metadata": {
                "chunk_id": "chunk_29",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_30",
            "page_content": "Selain area museum, di sini terdapat juga  Tjolomadoe Concert Hall dan juga Sarkara sebagai  multifunctional hall, selain itu terdapat juga toko-toko kecil  untuk 21\nJOURNEY TO WANDER\nFoto oleh : Ferrian Renaldi Turumun Private Museum - Surakarta\nSURAKARTA JOURNEY TO WANDER\nPeta Destinasi Wisata MAGELANG\nMenjadi destinasi terakhir, Magelang adalah penutup yang  berkesan selama  Journey To Wander  ini. Suasana Kota  Magelang yang asri dan indah memberikan perjalanan yang  kontemplatif. Berkunjung ke dua tempat yaitu Svarga Bumi  dan Balkondes sangat menyegarkan dan menenangkan  pikiran.",
            "metadata": {
                "chunk_id": "chunk_30",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_31",
            "page_content": "Berkunjung ke dua tempat yaitu Svarga Bumi  dan Balkondes sangat menyegarkan dan menenangkan  pikiran. Destinasi wisata yang tenang dengan pemandangan indah  membuat perjalanan bermakna. Kami mendapatkan banyak  inspirasi dan juga spot-spot otentik untuk liburan yang jangan  sampai terlewatkan ketika berkunjung ke Magelang. Selamat  menikmati beberapa karya fotografi, ilustrasi, hingga tulisan  sebagai referensi ketika berkunjung ke Magelang. 1\n2\nBalkondes Karangrejo\nSvargabumi Borobudur\n1\n2\nKawasan Candi Borobudur\nU\n24\nJOURNEY TO WANDER\nSVARGABUMI BOROBUDUR\nJl.",
            "metadata": {
                "chunk_id": "chunk_31",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_32",
            "page_content": "1\n2\nBalkondes Karangrejo\nSvargabumi Borobudur\n1\n2\nKawasan Candi Borobudur\nU\n24\nJOURNEY TO WANDER\nSVARGABUMI BOROBUDUR\nJl. Borobudur - Ngadiharjo, Sawah, Borobudur, Kec. Borobudur, Magelang, Jawa Tengah\nMAGELANG\n26\nKetika berkunjung ke tempat ini, mata kami tertuju oleh  pemandangan sawah yang luas dan terdapat berbagai macam  spot foto yang menarik. Svarga Bumi ini berlokasi cukup dekat  dengan Candi Borobudur. Untuk tiket masuk ke Svarga Bumi  cukup membayar 25 ribu (dewasa) dan 15 ribu (anak-anak). Di tempat ini kami bebas berfoto di mana saja, terdapat kurang  lebih 20 spot foto.",
            "metadata": {
                "chunk_id": "chunk_32",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_33",
            "page_content": "Di tempat ini kami bebas berfoto di mana saja, terdapat kurang  lebih 20 spot foto. Foto di ayunan, ranjang jaring-jaring, hingga  kursi gantung yang berlatar belakang pemandangan sawah. Setelah kami berswafoto di berbagai macam spot foto, Svarga  Bumi juga menyediakan tempat untuk melepas dahaga dengan  minum-minuman segar sambil duduk bersantai dibawah pohon. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\n27\nJOURNEY TO WANDER\nBALKONDES KARANG REJO\nBumen Djelapan, Karangrejo, Kec.",
            "metadata": {
                "chunk_id": "chunk_33",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_34",
            "page_content": "Wastana Haikal\n27\nJOURNEY TO WANDER\nBALKONDES KARANG REJO\nBumen Djelapan, Karangrejo, Kec. Borobudur, Magelang, Jawa Tengah\nMAGELANG\n28\nJika Anda penasaran dengan pengalaman membatik tulis secara  langsung di Magelang, cobalah mampir ke Balkondes atau Balai  Ekonomi Desa Magelang. Di sini kita bisa mendapatkan  pemandangan Magelang yang asri dan indah, sambil mencoba  langsung untuk membatik dibimbing langsung oleh pengrajin  batik Magelang. Anda juga bisa membawa pulang batik hasil  karya Anda untuk kenang-kenangan.",
            "metadata": {
                "chunk_id": "chunk_34",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_35",
            "page_content": "Anda juga bisa membawa pulang batik hasil  karya Anda untuk kenang-kenangan. Ulasan oleh : Debby Permata Foto oleh  : Ferrian Reynaldi Illustrasi oleh  : Wastana Haikal\n29\nJOURNEY TO WANDER\nMuseum De Tjolomadoe - Surakarta\n29\nPhotograph by  : Ferrian Reynaldi\nJOURNEY TO WANDER\n30",
            "metadata": {
                "chunk_id": "chunk_35",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_36",
            "page_content": "Perjalanan  ke  Semarang,  Solo,  &  Magelang  memberikan cerita sendiri-sendiri yang berkesan di  setiap tempatnya mengingatkan kita kembali akan  destinasi pariwisata Indonesia yang kaya akan sejarah,  nilai budaya, dan keindahan. Journey To Wander  menjadi sebuah semangat menghidupkan kembali  pariwisata Indonesia sebagai perjalanan yang tidak  hanya bersenang-senang, namun lebih dari itu  mengenal alam sekitar dalam kebersamaan dan  memaknai nilai budaya serta keindahan alam",
            "metadata": {
                "chunk_id": "chunk_36",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_37",
            "page_content": "nilai budaya serta keindahan alam Indonesia serta mengenalkan gerakan BISA (Bersih,  Indah, Sehat, dan Aman) sehingga kita bisa melakukan  traveling dengan saling menjaga keamanan dan  kenyamanan sesama. Semoga  bersama  mini-book  ini  kami  dapat  menyampaikan cerita perjalanan juga rekomendasi  destinasi wisata yang sudah memberlakukan protokol  kesehatan melalui gerakan BISA.",
            "metadata": {
                "chunk_id": "chunk_37",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_38",
            "page_content": "Semoga  bersama  mini-book  ini  kami  dapat  menyampaikan cerita perjalanan juga rekomendasi  destinasi wisata yang sudah memberlakukan protokol  kesehatan melalui gerakan BISA. Melalui karya-karya  yang tersaji diharapkan dapat memberikan inspirasi  untuk kamu pun dapat berkarya sesuai ketertarikan  dan hobi masing-masing ketika melakukan perjalanan  atau traveling dalam mengenal lebih dalam kekayaan  budaya serta bersatu dengan alam sekitar yang penuh  keindahan. Kami selaku Kementerian Pariwisata &  Ekonomi Kreatif (KEMENPAREKRAF) berterima kasih  kepada seluruh tim yang terlibat dan berharap akan  bertemu kembali bersama “Journey To Wander”  selanjutnya!",
            "metadata": {
                "chunk_id": "chunk_38",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        },
        {
            "doc_id": "chunk_39",
            "page_content": "Kami selaku Kementerian Pariwisata &  Ekonomi Kreatif (KEMENPAREKRAF) berterima kasih  kepada seluruh tim yang terlibat dan berharap akan  bertemu kembali bersama “Journey To Wander”  selanjutnya! KOLABORATOR\nWASTANA HAIKAL\nIllustrator   | @wastanahaikal\n@helloditta\nDITTA AMELIA\nIllustrator   | MADA RIYANHADI\nTraveller   |    @madariyanhadi\nFERRIAN REYNALDI\nPhotographer   | @adaptasi\nDEBBY PERMATA\nTraveller     | @debbypermata\nJOURNEY TO WANDER\n31\nwww.indonesia.travel\nindtravel indonesia.travel indonesia.travel",
            "metadata": {
                "chunk_id": "chunk_39",
                "filename": "Journey to Wander_Buku Panduan Wisata Semarang Surakarta dan Magelang.pdf",
                "source_id": "15b59965-4509-435f-9b41-e6f849ef4110",
                "user_id": 1,
                "language": "id"
            }
        }
    ],
    "index_to_docstore_id": {
        "0": "chunk_0",
        "1": "chunk_1",
        "2": "chunk_2",
        "3": "chunk_3",
        "4": "chunk_4",
        "5": "chunk_5",
        "6": "chunk_6",
        "7": "chunk_7",
        "8": "chunk_8",
        "9": "chunk_9",
        "10": "chunk_10",
        "11": "chunk_11",
        "12": "chunk_12",
        "13": "chunk_13",
        "14": "chunk_14",
        "15": "chunk_15",
        "16": "chunk_16",
        "17": "chunk_17",
        "18": "chunk_18",
        "19": "chunk_19",
        "20": "chunk_20",
        "21": "chunk_21",
        "22": "chunk_22",
        "23": "chunk_23",
        "24": "chunk_24",
        "25": "chunk_25",
        "26": "chunk_26",
        "27": "chunk_27",
        "28": "chunk_28",
        "29": "chunk_29",
        "30": "chunk_30",
        "31": "chunk_31",
        "32": "chunk_32",
        "33": "chunk_33",
        "34": "chunk_34",
        "35": "chunk_35",
        "36": "chunk_36",
        "37": "chunk_37",
        "38": "chunk_38",
        "39": "chunk_39"
    }
}